run/tutorials/incompressible/pimpleFoam/TJunctionFan/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            uniformTotalPressure;
        rho             none;
        psi             none;
        gamma           1;
        p0              40;
        pressure        table
        (
            (0 10)
            (1 40)
        );
        value           uniform 40;
    }
    outlet1
    {
        type            fixedValue;
        value           uniform 10;
    }
    outlet2
    {
        type            fixedValue;
        value           uniform 0;
    }
    baffles
    {
        type            zeroGradient;
    }
    fan_half0
    {
        type            fan;
        patchType       cyclic;
        jump            uniform 0;
        f               2(100 -0.1);
        value           uniform 0;
    }
    fan_half1
    {
        type            fan;
        patchType       cyclic;
        jump            uniform 0;
        f               2(100 -0.1);
        value           uniform 0;
    }
    defaultFaces
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
